[
  {
    "id": 1,
    "Title": "Jollof Rice",
    "Description": "The best Jollof recipe",
    "Ingredients": [
      "4 cups of rice",
      "1kg Chicken/beef",
      "1000ml of Ground Fresh tomatoes",
      "500ml Ground Fresh peppers",
      "3 Tablespoons Curry powder",
      "1 Tablespoon Thyme",
      "2 seasoning cubes",
      "1 cup of sliced onions",
      "300ml vegetable oil",
      "salt to taste",
      "2 cloves of garlic",
      "2 Tablespoons of ginger paste"
    ],
    "Steps": [
      "Season the chicken/beef with a teaspoon of salt, one seasoning cube, half 2 teaspoons of curry and 1 teaspoon of thyme, half a cup of sliced onions then let it sit for some minutes. For chicken, set on heat and let it boil for 10-15 minutes, beef would take around 20-30 minutes.",
      "Set aside the meat and the stock in fresh bowls. Peel off the outer back of the ginger/garlic, then pound or grind whichever you prefer.",
      "Wash your rice with hot water and salt first, then room temperature water till the water runs clear",
      "Take the meat which must've cooled down and deep fry, set aside after frying.",
      "Once you are done with frying the meat, reduce the oil to 250ml (1 cup), add the remaining one cup of sliced onions, carmelise for 1-2 minutes, then add the pepper mix. Using the same oil you used in frying the meat add flavor to the jollof rice.",
      "Frying the pepper mix would take about 20 minutes. Fry until when you lift a portion with your frying spoon, you will notice the oil continues to boil in the spoon. You also notice the tomatoes turning dark. It should begin to look like stew at this point.",
      "Once the pepper mix is well fried, add the meat stock (chicken/beef stock) to the fried pepper mix in the pot, the ground ginger/garlic, 3 tablesoons of curry and a tablespoon of thyme, salt to taste, and 3 cups of water. Add another seasoning cube. Stir and taste, it should taste overly spiced. Don't worry, once the rice is added the taste would balance.",
      "Add the rice. Then cover and allow the rice to cook on low heat for 30-45 minutes. Remember that you can add water occasionally if the water isn't enough."
    ]
  }
]
